module Ark.Colour where

orange0 = rgb 204 153 102
orange1 = rgb 227 169  85
cyan0   = rgb 153 204 153
cyan1   = rgb 145 183 171
blue0   = rgb 102 102 153
blue1   = rgb  77  91 135
green0  = rgb 153 153  51
green1  = rgb 171 167  75
brown0  = rgb 102 102 102
brown1  = rgb 100 100  92
velvet0 = rgb 204  51 102
velvet1 = rgb 181  68 101

-- what if the background is dark?
-- белый на чёрном ))
-- светлые квадратики в календаре DCDDDE
-- тёмные квадратики там же B6B7B9

-- цветные даты условны весьма, так что можешь использовать пока вот это:
-- желтый E3A955
-- мятный 91B7AB
-- травянисто-зеленый ABA84B

-- цвет дат - давай попробуем дать чуть светлее, чем цвет основного меню: 7D7E80
-- цифры на цветных, заспектакленых датах можем дать чёрными?.. или это лишний геморрой?..
